# ProjectionPlanesNotIntersect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..ProjectionPlanesNotIntersect Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Can't project Analytical Model. Planes do not intersect each other.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProjectionPlanesNotIntersect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProjectionPlanesNotIntersect As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProjectionPlanesNotIntersect {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace